  final List<String> faqItems = [
    "พัสดุหายหรือมีปัญหา ต้องทำอย่างไร?",
    "หากอยู่ผิดบ้านเลขที่/ห้อง ต้องทำอย่างไร?",
    "เพิ่ม/ลด สมาชิกในห้อง อย่างไร?",
    "เป็นเจ้าของหลายห้อง ต้องทำอย่างไร?",
    "เป็นเจ้าของคอนโดหลายแห่ง ต้องทำอย่างไร?",
    "หน้าสมุดโทรศัพท์ข้อมูลไม่ครบถ้วน จะเพิ่มข้อมูลเบอร์โทรศัพท์ได้อย่างไร?",
    "มีฟีเจอร์พิเศษสำหรับกรรมการหรือไม่ และจะใช้งานฟีเจอร์นั้นได้อย่างไร?",
    "รหัสเชิญหาย/หมดอายุ ขอใหม่จากที่ไหน?",
    "How to change language? เปลี่ยนภาษาอย่างไร?",
  ];


  
  final List<String> faqDetails = [
    "ACS Community เป็นเครื่องมือช่วยแจ้งเตือนพัสดุแก่ท่าน ดังนั้นหากมีปัญหาใด ๆ เกี่ยวกับพัสดุ กรุณาติดต่อเจ้าหน้าที่นิติบุคคลของท่าน",
    "1. เพิ่มห้องที่ถูกต้องก่อนด้วยการ\n 1.1 ไปที่เมนู \"ห้องของฉัน\"\n 1.2 กด \"เพิ่มห้อง\" เพื่อกรอกรหัสเชิญของห้องที่ถูกต้อง\n\n2. ออกจากห้องที่ผิด \n 2.1 กดที่ปุ่ม ... ที่อยู่บนบรรทัดของท่าน แล้วเลือก \"ออกจากบ้านเลขที่นี้\" \n 2.2 กด \"ย้ายออก\" เพื่อย้ายออกจากห้องที่อยู่ผิด",
    "การเพิ่มสมาชิก\n1. ไปที่เมนู \"ห้องของฉัน\" \n2. กด \"ดูรหัสเชิญ\" \n3. ส่งรหัสเชิญให้สมาชิกใหม่ \n\n การลดสมาชิก\n1. ไปที่เมนู \"ห้องของฉัน\"\n2. กดที่ปุ่ม \"...\" ด้านขวาของชื่อสมาชิก แล้วกด \"แจ้งย้ายออก\"\n3. ระบบจะส่งคำเตือนไปให้สมาชิกคนนั้นยืนยันการย้ายออก\n4. หากสมาชิกดังกล่าวไม่กดตอบรับใด ๆ ภายใน 15 วัน ระบบจะลบสมาชิกออกให้อัตโนมัติ",
    "1. ติดต่อเจ้าหน้าที่นิติบุคคลเพื่อขอรหัสใหม่ \n2. ไปที่เมนู \"ห้องของฉัน\"\n3. กดปุ่ม \"เพิ่มห้อง\"\n4. กรอกรหัสเชิญใหม่\n\n ท่านสามารถออกจากห้องได้โดยการกลับไปที่เมนู \"ห้องของฉัน\" และกดปุ่มย้ายออก",
    "1. ติดต่อขอรหัสเชิญจากเจ้าหน้าที่นิติบุคคลของอีกคอนโดที่ใช้ระบบ ACS Community\n2. ไปที่เมนู \"เปลี่ยนชุมชน\"\n3. กดปุ่ม \"เพิ่มชุมชน\"\n4. กรอกรหัสเชิญ",
    "โปรดติดต่อนิติฯของท่าน ให้ทำการเพิ่มเบอร์โทรศัพท์ผ่านทางเว็บไซต์ของเรา",
    "มีฟีเจอร์พิเศษเฉพาะสำหรับกรรมการเช่น \"กระดานงาน\" ไว้ใช้ติดตามงานต่าง ๆ กับนิติบุคคล\n\nกรรมการสามารถติดต่อนิติบุคคล เพื่อขอใช้งานฟีเจอร์ดังกล่าว",
    "ท่านสามารถขอรหัสเชิญได้ใหม่จากทางนิติบุคคล หรือจากสมาชิกในห้องที่ใช้งานแอปฯแล้ว",
    "1. Go to \"Settings\" menu in your bottom right menu\n2. Click \"ภาษา / Language\"\n3. Choose language",
  ];